program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.7.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 518, 518]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 518, 518]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<fp32, [1, 3, 1, 1]> image__biased___y_0 = const()[name = tensor<string, []>("image__biased___y_0"), val = tensor<fp32, [1, 3, 1, 1]>([[[[-0x1.0f177ap+1]], [[-0x1.04924ap+1]], [[-0x1.cdf012p+0]]]])];
            tensor<fp32, [1, 3, 518, 518]> image__biased__ = add(x = image__scaled__, y = image__biased___y_0)[name = tensor<string, []>("image__biased__")];
            tensor<string, []> x_3_pad_type_0 = const()[name = tensor<string, []>("x_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_3_strides_0 = const()[name = tensor<string, []>("x_3_strides_0"), val = tensor<int32, [2]>([14, 14])];
            tensor<int32, [4]> x_3_pad_0 = const()[name = tensor<string, []>("x_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_3_dilations_0 = const()[name = tensor<string, []>("x_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x_3_groups_0 = const()[name = tensor<string, []>("x_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [384, 3, 14, 14]> pretrained_patch_embed_proj_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_patch_embed_proj_weight_to_fp16"), val = tensor<fp16, [384, 3, 14, 14]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [384]> pretrained_patch_embed_proj_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_patch_embed_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(451712)))];
            tensor<fp16, [1, 3, 518, 518]> image_to_fp16 = cast(dtype = image_to_fp16_dtype_0, x = image__biased__)[name = tensor<string, []>("cast_30")];
            tensor<fp16, [1, 384, 37, 37]> x_3_cast_fp16 = conv(bias = pretrained_patch_embed_proj_bias_to_fp16, dilations = x_3_dilations_0, groups = x_3_groups_0, pad = x_3_pad_0, pad_type = x_3_pad_type_0, strides = x_3_strides_0, weight = pretrained_patch_embed_proj_weight_to_fp16, x = image_to_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 384, 1369])];
            tensor<fp16, [1, 384, 1369]> var_80_cast_fp16 = reshape(shape = concat_0, x = x_3_cast_fp16)[name = tensor<string, []>("op_80_cast_fp16")];
            tensor<int32, [3]> x_5_perm_0 = const()[name = tensor<string, []>("x_5_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, []> var_92 = const()[name = tensor<string, []>("op_92"), val = tensor<int32, []>(1)];
            tensor<bool, []> x_7_interleave_0 = const()[name = tensor<string, []>("x_7_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 384]> pretrained_cls_token_to_fp16 = const()[name = tensor<string, []>("pretrained_cls_token_to_fp16"), val = tensor<fp16, [1, 1, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(452544)))];
            tensor<fp16, [1, 1369, 384]> x_5_cast_fp16 = transpose(perm = x_5_perm_0, x = var_80_cast_fp16)[name = tensor<string, []>("transpose_28")];
            tensor<fp16, [1, 1370, 384]> x_7_cast_fp16 = concat(axis = var_92, interleave = x_7_interleave_0, values = (pretrained_cls_token_to_fp16, x_5_cast_fp16))[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> pretrained_pos_embed_to_fp16 = const()[name = tensor<string, []>("pretrained_pos_embed_to_fp16"), val = tensor<fp16, [1, 1370, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(453376)))];
            tensor<fp16, [1, 1370, 384]> input_1_cast_fp16 = add(x = x_7_cast_fp16, y = pretrained_pos_embed_to_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, []> var_105 = const()[name = tensor<string, []>("op_105"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> x_9_axes_0 = const()[name = tensor<string, []>("x_9_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> pretrained_blocks_0_norm1_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1505600)))];
            tensor<fp16, [384]> pretrained_blocks_0_norm1_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1506432)))];
            tensor<fp16, []> var_110_to_fp16 = const()[name = tensor<string, []>("op_110_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 1370, 384]> x_9_cast_fp16 = layer_norm(axes = x_9_axes_0, beta = pretrained_blocks_0_norm1_bias_to_fp16, epsilon = var_110_to_fp16, gamma = pretrained_blocks_0_norm1_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<fp16, [1152, 384]> pretrained_blocks_0_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1507264)))];
            tensor<fp16, [1152]> pretrained_blocks_0_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2392064)))];
            tensor<fp16, [1, 1370, 1152]> linear_0_cast_fp16 = linear(bias = pretrained_blocks_0_attn_qkv_bias_to_fp16, weight = pretrained_blocks_0_attn_qkv_weight_to_fp16, x = x_9_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<int32, [5]> var_133 = const()[name = tensor<string, []>("op_133"), val = tensor<int32, [5]>([1, 1370, 3, 6, 64])];
            tensor<fp16, [1, 1370, 3, 6, 64]> var_134_cast_fp16 = reshape(shape = var_133, x = linear_0_cast_fp16)[name = tensor<string, []>("op_134_cast_fp16")];
            tensor<int32, [5]> var_135 = const()[name = tensor<string, []>("op_135"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_137_begin_0 = const()[name = tensor<string, []>("op_137_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_137_end_0 = const()[name = tensor<string, []>("op_137_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1370, 64])];
            tensor<bool, [5]> var_137_end_mask_0 = const()[name = tensor<string, []>("op_137_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_137_squeeze_mask_0 = const()[name = tensor<string, []>("op_137_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1370, 64]> qkv_1_cast_fp16 = transpose(perm = var_135, x = var_134_cast_fp16)[name = tensor<string, []>("transpose_27")];
            tensor<fp16, [1, 6, 1370, 64]> var_137_cast_fp16 = slice_by_index(begin = var_137_begin_0, end = var_137_end_0, end_mask = var_137_end_mask_0, squeeze_mask = var_137_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("op_137_cast_fp16")];
            tensor<fp16, []> var_138_to_fp16 = const()[name = tensor<string, []>("op_138_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1370, 64]> q_1_cast_fp16 = mul(x = var_137_cast_fp16, y = var_138_to_fp16)[name = tensor<string, []>("q_1_cast_fp16")];
            tensor<int32, [5]> k_1_begin_0 = const()[name = tensor<string, []>("k_1_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_1_end_0 = const()[name = tensor<string, []>("k_1_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1370, 64])];
            tensor<bool, [5]> k_1_end_mask_0 = const()[name = tensor<string, []>("k_1_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_1_squeeze_mask_0 = const()[name = tensor<string, []>("k_1_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> k_1_cast_fp16 = slice_by_index(begin = k_1_begin_0, end = k_1_end_0, end_mask = k_1_end_mask_0, squeeze_mask = k_1_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<int32, [5]> v_1_begin_0 = const()[name = tensor<string, []>("v_1_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_1_end_0 = const()[name = tensor<string, []>("v_1_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1370, 64])];
            tensor<bool, [5]> v_1_end_mask_0 = const()[name = tensor<string, []>("v_1_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_1_squeeze_mask_0 = const()[name = tensor<string, []>("v_1_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> v_1_cast_fp16 = slice_by_index(begin = v_1_begin_0, end = v_1_end_0, end_mask = v_1_end_mask_0, squeeze_mask = v_1_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("v_1_cast_fp16")];
            tensor<bool, []> attn_1_transpose_x_1 = const()[name = tensor<string, []>("attn_1_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_1_transpose_y_1 = const()[name = tensor<string, []>("attn_1_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1370, 1370]> attn_1_cast_fp16 = matmul(transpose_x = attn_1_transpose_x_1, transpose_y = attn_1_transpose_y_1, x = q_1_cast_fp16, y = k_1_cast_fp16)[name = tensor<string, []>("attn_1_cast_fp16")];
            tensor<fp16, [1, 6, 1370, 1370]> input_3_cast_fp16 = softmax(axis = var_105, x = attn_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<bool, []> var_146_transpose_x_0 = const()[name = tensor<string, []>("op_146_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_146_transpose_y_0 = const()[name = tensor<string, []>("op_146_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1370, 64]> var_146_cast_fp16 = matmul(transpose_x = var_146_transpose_x_0, transpose_y = var_146_transpose_y_0, x = input_3_cast_fp16, y = v_1_cast_fp16)[name = tensor<string, []>("op_146_cast_fp16")];
            tensor<int32, [4]> var_147_perm_0 = const()[name = tensor<string, []>("op_147_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_148 = const()[name = tensor<string, []>("op_148"), val = tensor<int32, [3]>([1, 1370, 384])];
            tensor<fp16, [1, 1370, 6, 64]> var_147_cast_fp16 = transpose(perm = var_147_perm_0, x = var_146_cast_fp16)[name = tensor<string, []>("transpose_26")];
            tensor<fp16, [1, 1370, 384]> input_5_cast_fp16 = reshape(shape = var_148, x = var_147_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [384, 384]> pretrained_blocks_0_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2394432)))];
            tensor<fp16, [384]> pretrained_blocks_0_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2689408)))];
            tensor<fp16, [1, 1370, 384]> linear_1_cast_fp16 = linear(bias = pretrained_blocks_0_attn_proj_bias_to_fp16, weight = pretrained_blocks_0_attn_proj_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [384]> pretrained_blocks_0_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2690240)))];
            tensor<fp16, [1, 1370, 384]> var_155_cast_fp16 = mul(x = linear_1_cast_fp16, y = pretrained_blocks_0_ls1_gamma_to_fp16)[name = tensor<string, []>("op_155_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_9_cast_fp16 = add(x = input_1_cast_fp16, y = var_155_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [1]> input_11_axes_0 = const()[name = tensor<string, []>("input_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> pretrained_blocks_0_norm2_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2691072)))];
            tensor<fp16, [384]> pretrained_blocks_0_norm2_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2691904)))];
            tensor<fp16, [1, 1370, 384]> input_11_cast_fp16 = layer_norm(axes = input_11_axes_0, beta = pretrained_blocks_0_norm2_bias_to_fp16, epsilon = var_110_to_fp16, gamma = pretrained_blocks_0_norm2_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [1536, 384]> pretrained_blocks_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2692736)))];
            tensor<fp16, [1536]> pretrained_blocks_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3872448)))];
            tensor<fp16, [1, 1370, 1536]> linear_2_cast_fp16 = linear(bias = pretrained_blocks_0_mlp_fc1_bias_to_fp16, weight = pretrained_blocks_0_mlp_fc1_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<string, []> input_15_mode_0 = const()[name = tensor<string, []>("input_15_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1370, 1536]> input_15_cast_fp16 = gelu(mode = input_15_mode_0, x = linear_2_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [384, 1536]> pretrained_blocks_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3875584)))];
            tensor<fp16, [384]> pretrained_blocks_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5055296)))];
            tensor<fp16, [1, 1370, 384]> linear_3_cast_fp16 = linear(bias = pretrained_blocks_0_mlp_fc2_bias_to_fp16, weight = pretrained_blocks_0_mlp_fc2_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [384]> pretrained_blocks_0_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_0_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5056128)))];
            tensor<fp16, [1, 1370, 384]> var_173_cast_fp16 = mul(x = linear_3_cast_fp16, y = pretrained_blocks_0_ls2_gamma_to_fp16)[name = tensor<string, []>("op_173_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_21_cast_fp16 = add(x = input_9_cast_fp16, y = var_173_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<int32, []> var_184 = const()[name = tensor<string, []>("op_184"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> x_15_axes_0 = const()[name = tensor<string, []>("x_15_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> pretrained_blocks_1_norm1_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5056960)))];
            tensor<fp16, [384]> pretrained_blocks_1_norm1_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5057792)))];
            tensor<fp16, []> var_189_to_fp16 = const()[name = tensor<string, []>("op_189_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 1370, 384]> x_15_cast_fp16 = layer_norm(axes = x_15_axes_0, beta = pretrained_blocks_1_norm1_bias_to_fp16, epsilon = var_189_to_fp16, gamma = pretrained_blocks_1_norm1_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("x_15_cast_fp16")];
            tensor<fp16, [1152, 384]> pretrained_blocks_1_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5058624)))];
            tensor<fp16, [1152]> pretrained_blocks_1_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5943424)))];
            tensor<fp16, [1, 1370, 1152]> linear_4_cast_fp16 = linear(bias = pretrained_blocks_1_attn_qkv_bias_to_fp16, weight = pretrained_blocks_1_attn_qkv_weight_to_fp16, x = x_15_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<int32, [5]> var_212 = const()[name = tensor<string, []>("op_212"), val = tensor<int32, [5]>([1, 1370, 3, 6, 64])];
            tensor<fp16, [1, 1370, 3, 6, 64]> var_213_cast_fp16 = reshape(shape = var_212, x = linear_4_cast_fp16)[name = tensor<string, []>("op_213_cast_fp16")];
            tensor<int32, [5]> var_214 = const()[name = tensor<string, []>("op_214"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_216_begin_0 = const()[name = tensor<string, []>("op_216_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_216_end_0 = const()[name = tensor<string, []>("op_216_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1370, 64])];
            tensor<bool, [5]> var_216_end_mask_0 = const()[name = tensor<string, []>("op_216_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_216_squeeze_mask_0 = const()[name = tensor<string, []>("op_216_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1370, 64]> qkv_3_cast_fp16 = transpose(perm = var_214, x = var_213_cast_fp16)[name = tensor<string, []>("transpose_25")];
            tensor<fp16, [1, 6, 1370, 64]> var_216_cast_fp16 = slice_by_index(begin = var_216_begin_0, end = var_216_end_0, end_mask = var_216_end_mask_0, squeeze_mask = var_216_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("op_216_cast_fp16")];
            tensor<fp16, []> var_217_to_fp16 = const()[name = tensor<string, []>("op_217_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1370, 64]> q_3_cast_fp16 = mul(x = var_216_cast_fp16, y = var_217_to_fp16)[name = tensor<string, []>("q_3_cast_fp16")];
            tensor<int32, [5]> k_3_begin_0 = const()[name = tensor<string, []>("k_3_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_3_end_0 = const()[name = tensor<string, []>("k_3_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1370, 64])];
            tensor<bool, [5]> k_3_end_mask_0 = const()[name = tensor<string, []>("k_3_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_3_squeeze_mask_0 = const()[name = tensor<string, []>("k_3_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> k_3_cast_fp16 = slice_by_index(begin = k_3_begin_0, end = k_3_end_0, end_mask = k_3_end_mask_0, squeeze_mask = k_3_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<int32, [5]> v_3_begin_0 = const()[name = tensor<string, []>("v_3_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_3_end_0 = const()[name = tensor<string, []>("v_3_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1370, 64])];
            tensor<bool, [5]> v_3_end_mask_0 = const()[name = tensor<string, []>("v_3_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_3_squeeze_mask_0 = const()[name = tensor<string, []>("v_3_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> v_3_cast_fp16 = slice_by_index(begin = v_3_begin_0, end = v_3_end_0, end_mask = v_3_end_mask_0, squeeze_mask = v_3_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("v_3_cast_fp16")];
            tensor<bool, []> attn_5_transpose_x_1 = const()[name = tensor<string, []>("attn_5_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_5_transpose_y_1 = const()[name = tensor<string, []>("attn_5_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1370, 1370]> attn_5_cast_fp16 = matmul(transpose_x = attn_5_transpose_x_1, transpose_y = attn_5_transpose_y_1, x = q_3_cast_fp16, y = k_3_cast_fp16)[name = tensor<string, []>("attn_5_cast_fp16")];
            tensor<fp16, [1, 6, 1370, 1370]> input_23_cast_fp16 = softmax(axis = var_184, x = attn_5_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<bool, []> var_225_transpose_x_0 = const()[name = tensor<string, []>("op_225_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_225_transpose_y_0 = const()[name = tensor<string, []>("op_225_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1370, 64]> var_225_cast_fp16 = matmul(transpose_x = var_225_transpose_x_0, transpose_y = var_225_transpose_y_0, x = input_23_cast_fp16, y = v_3_cast_fp16)[name = tensor<string, []>("op_225_cast_fp16")];
            tensor<int32, [4]> var_226_perm_0 = const()[name = tensor<string, []>("op_226_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_227 = const()[name = tensor<string, []>("op_227"), val = tensor<int32, [3]>([1, 1370, 384])];
            tensor<fp16, [1, 1370, 6, 64]> var_226_cast_fp16 = transpose(perm = var_226_perm_0, x = var_225_cast_fp16)[name = tensor<string, []>("transpose_24")];
            tensor<fp16, [1, 1370, 384]> input_25_cast_fp16 = reshape(shape = var_227, x = var_226_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [384, 384]> pretrained_blocks_1_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5945792)))];
            tensor<fp16, [384]> pretrained_blocks_1_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6240768)))];
            tensor<fp16, [1, 1370, 384]> linear_5_cast_fp16 = linear(bias = pretrained_blocks_1_attn_proj_bias_to_fp16, weight = pretrained_blocks_1_attn_proj_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [384]> pretrained_blocks_1_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6241600)))];
            tensor<fp16, [1, 1370, 384]> var_234_cast_fp16 = mul(x = linear_5_cast_fp16, y = pretrained_blocks_1_ls1_gamma_to_fp16)[name = tensor<string, []>("op_234_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_29_cast_fp16 = add(x = input_21_cast_fp16, y = var_234_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<int32, [1]> input_31_axes_0 = const()[name = tensor<string, []>("input_31_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> pretrained_blocks_1_norm2_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6242432)))];
            tensor<fp16, [384]> pretrained_blocks_1_norm2_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6243264)))];
            tensor<fp16, [1, 1370, 384]> input_31_cast_fp16 = layer_norm(axes = input_31_axes_0, beta = pretrained_blocks_1_norm2_bias_to_fp16, epsilon = var_189_to_fp16, gamma = pretrained_blocks_1_norm2_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [1536, 384]> pretrained_blocks_1_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6244096)))];
            tensor<fp16, [1536]> pretrained_blocks_1_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7423808)))];
            tensor<fp16, [1, 1370, 1536]> linear_6_cast_fp16 = linear(bias = pretrained_blocks_1_mlp_fc1_bias_to_fp16, weight = pretrained_blocks_1_mlp_fc1_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<string, []> input_35_mode_0 = const()[name = tensor<string, []>("input_35_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1370, 1536]> input_35_cast_fp16 = gelu(mode = input_35_mode_0, x = linear_6_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<fp16, [384, 1536]> pretrained_blocks_1_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7426944)))];
            tensor<fp16, [384]> pretrained_blocks_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8606656)))];
            tensor<fp16, [1, 1370, 384]> linear_7_cast_fp16 = linear(bias = pretrained_blocks_1_mlp_fc2_bias_to_fp16, weight = pretrained_blocks_1_mlp_fc2_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [384]> pretrained_blocks_1_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_1_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8607488)))];
            tensor<fp16, [1, 1370, 384]> var_252_cast_fp16 = mul(x = linear_7_cast_fp16, y = pretrained_blocks_1_ls2_gamma_to_fp16)[name = tensor<string, []>("op_252_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_41_cast_fp16 = add(x = input_29_cast_fp16, y = var_252_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<int32, []> var_263 = const()[name = tensor<string, []>("op_263"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> x_21_axes_0 = const()[name = tensor<string, []>("x_21_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> pretrained_blocks_2_norm1_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8608320)))];
            tensor<fp16, [384]> pretrained_blocks_2_norm1_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8609152)))];
            tensor<fp16, []> var_268_to_fp16 = const()[name = tensor<string, []>("op_268_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 1370, 384]> x_21_cast_fp16 = layer_norm(axes = x_21_axes_0, beta = pretrained_blocks_2_norm1_bias_to_fp16, epsilon = var_268_to_fp16, gamma = pretrained_blocks_2_norm1_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<fp16, [1152, 384]> pretrained_blocks_2_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8609984)))];
            tensor<fp16, [1152]> pretrained_blocks_2_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9494784)))];
            tensor<fp16, [1, 1370, 1152]> linear_8_cast_fp16 = linear(bias = pretrained_blocks_2_attn_qkv_bias_to_fp16, weight = pretrained_blocks_2_attn_qkv_weight_to_fp16, x = x_21_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [5]> var_291 = const()[name = tensor<string, []>("op_291"), val = tensor<int32, [5]>([1, 1370, 3, 6, 64])];
            tensor<fp16, [1, 1370, 3, 6, 64]> var_292_cast_fp16 = reshape(shape = var_291, x = linear_8_cast_fp16)[name = tensor<string, []>("op_292_cast_fp16")];
            tensor<int32, [5]> var_293 = const()[name = tensor<string, []>("op_293"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_295_begin_0 = const()[name = tensor<string, []>("op_295_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_295_end_0 = const()[name = tensor<string, []>("op_295_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1370, 64])];
            tensor<bool, [5]> var_295_end_mask_0 = const()[name = tensor<string, []>("op_295_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_295_squeeze_mask_0 = const()[name = tensor<string, []>("op_295_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1370, 64]> qkv_5_cast_fp16 = transpose(perm = var_293, x = var_292_cast_fp16)[name = tensor<string, []>("transpose_23")];
            tensor<fp16, [1, 6, 1370, 64]> var_295_cast_fp16 = slice_by_index(begin = var_295_begin_0, end = var_295_end_0, end_mask = var_295_end_mask_0, squeeze_mask = var_295_squeeze_mask_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("op_295_cast_fp16")];
            tensor<fp16, []> var_296_to_fp16 = const()[name = tensor<string, []>("op_296_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1370, 64]> q_5_cast_fp16 = mul(x = var_295_cast_fp16, y = var_296_to_fp16)[name = tensor<string, []>("q_5_cast_fp16")];
            tensor<int32, [5]> k_5_begin_0 = const()[name = tensor<string, []>("k_5_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_5_end_0 = const()[name = tensor<string, []>("k_5_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1370, 64])];
            tensor<bool, [5]> k_5_end_mask_0 = const()[name = tensor<string, []>("k_5_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_5_squeeze_mask_0 = const()[name = tensor<string, []>("k_5_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> k_5_cast_fp16 = slice_by_index(begin = k_5_begin_0, end = k_5_end_0, end_mask = k_5_end_mask_0, squeeze_mask = k_5_squeeze_mask_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("k_5_cast_fp16")];
            tensor<int32, [5]> v_5_begin_0 = const()[name = tensor<string, []>("v_5_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_5_end_0 = const()[name = tensor<string, []>("v_5_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1370, 64])];
            tensor<bool, [5]> v_5_end_mask_0 = const()[name = tensor<string, []>("v_5_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_5_squeeze_mask_0 = const()[name = tensor<string, []>("v_5_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> v_5_cast_fp16 = slice_by_index(begin = v_5_begin_0, end = v_5_end_0, end_mask = v_5_end_mask_0, squeeze_mask = v_5_squeeze_mask_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("v_5_cast_fp16")];
            tensor<bool, []> attn_9_transpose_x_1 = const()[name = tensor<string, []>("attn_9_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_9_transpose_y_1 = const()[name = tensor<string, []>("attn_9_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1370, 1370]> attn_9_cast_fp16 = matmul(transpose_x = attn_9_transpose_x_1, transpose_y = attn_9_transpose_y_1, x = q_5_cast_fp16, y = k_5_cast_fp16)[name = tensor<string, []>("attn_9_cast_fp16")];
            tensor<fp16, [1, 6, 1370, 1370]> input_43_cast_fp16 = softmax(axis = var_263, x = attn_9_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<bool, []> var_304_transpose_x_0 = const()[name = tensor<string, []>("op_304_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_304_transpose_y_0 = const()[name = tensor<string, []>("op_304_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1370, 64]> var_304_cast_fp16 = matmul(transpose_x = var_304_transpose_x_0, transpose_y = var_304_transpose_y_0, x = input_43_cast_fp16, y = v_5_cast_fp16)[name = tensor<string, []>("op_304_cast_fp16")];
            tensor<int32, [4]> var_305_perm_0 = const()[name = tensor<string, []>("op_305_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_306 = const()[name = tensor<string, []>("op_306"), val = tensor<int32, [3]>([1, 1370, 384])];
            tensor<fp16, [1, 1370, 6, 64]> var_305_cast_fp16 = transpose(perm = var_305_perm_0, x = var_304_cast_fp16)[name = tensor<string, []>("transpose_22")];
            tensor<fp16, [1, 1370, 384]> input_45_cast_fp16 = reshape(shape = var_306, x = var_305_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<fp16, [384, 384]> pretrained_blocks_2_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9497152)))];
            tensor<fp16, [384]> pretrained_blocks_2_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9792128)))];
            tensor<fp16, [1, 1370, 384]> linear_9_cast_fp16 = linear(bias = pretrained_blocks_2_attn_proj_bias_to_fp16, weight = pretrained_blocks_2_attn_proj_weight_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [384]> pretrained_blocks_2_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9792960)))];
            tensor<fp16, [1, 1370, 384]> var_313_cast_fp16 = mul(x = linear_9_cast_fp16, y = pretrained_blocks_2_ls1_gamma_to_fp16)[name = tensor<string, []>("op_313_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_49_cast_fp16 = add(x = input_41_cast_fp16, y = var_313_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<int32, [1]> input_51_axes_0 = const()[name = tensor<string, []>("input_51_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> pretrained_blocks_2_norm2_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9793792)))];
            tensor<fp16, [384]> pretrained_blocks_2_norm2_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9794624)))];
            tensor<fp16, [1, 1370, 384]> input_51_cast_fp16 = layer_norm(axes = input_51_axes_0, beta = pretrained_blocks_2_norm2_bias_to_fp16, epsilon = var_268_to_fp16, gamma = pretrained_blocks_2_norm2_weight_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [1536, 384]> pretrained_blocks_2_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9795456)))];
            tensor<fp16, [1536]> pretrained_blocks_2_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10975168)))];
            tensor<fp16, [1, 1370, 1536]> linear_10_cast_fp16 = linear(bias = pretrained_blocks_2_mlp_fc1_bias_to_fp16, weight = pretrained_blocks_2_mlp_fc1_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<string, []> input_55_mode_0 = const()[name = tensor<string, []>("input_55_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1370, 1536]> input_55_cast_fp16 = gelu(mode = input_55_mode_0, x = linear_10_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<fp16, [384, 1536]> pretrained_blocks_2_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10978304)))];
            tensor<fp16, [384]> pretrained_blocks_2_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12158016)))];
            tensor<fp16, [1, 1370, 384]> linear_11_cast_fp16 = linear(bias = pretrained_blocks_2_mlp_fc2_bias_to_fp16, weight = pretrained_blocks_2_mlp_fc2_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [384]> pretrained_blocks_2_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_2_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12158848)))];
            tensor<fp16, [1, 1370, 384]> var_331_cast_fp16 = mul(x = linear_11_cast_fp16, y = pretrained_blocks_2_ls2_gamma_to_fp16)[name = tensor<string, []>("op_331_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_61_cast_fp16 = add(x = input_49_cast_fp16, y = var_331_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<int32, []> var_342 = const()[name = tensor<string, []>("op_342"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> x_27_axes_0 = const()[name = tensor<string, []>("x_27_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> pretrained_blocks_3_norm1_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_3_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12159680)))];
            tensor<fp16, [384]> pretrained_blocks_3_norm1_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_3_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12160512)))];
            tensor<fp16, []> var_347_to_fp16 = const()[name = tensor<string, []>("op_347_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 1370, 384]> x_27_cast_fp16 = layer_norm(axes = x_27_axes_0, beta = pretrained_blocks_3_norm1_bias_to_fp16, epsilon = var_347_to_fp16, gamma = pretrained_blocks_3_norm1_weight_to_fp16, x = input_61_cast_fp16)[name = tensor<string, []>("x_27_cast_fp16")];
            tensor<fp16, [1152, 384]> pretrained_blocks_3_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_3_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12161344)))];
            tensor<fp16, [1152]> pretrained_blocks_3_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_3_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13046144)))];
            tensor<fp16, [1, 1370, 1152]> linear_12_cast_fp16 = linear(bias = pretrained_blocks_3_attn_qkv_bias_to_fp16, weight = pretrained_blocks_3_attn_qkv_weight_to_fp16, x = x_27_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [5]> var_370 = const()[name = tensor<string, []>("op_370"), val = tensor<int32, [5]>([1, 1370, 3, 6, 64])];
            tensor<fp16, [1, 1370, 3, 6, 64]> var_371_cast_fp16 = reshape(shape = var_370, x = linear_12_cast_fp16)[name = tensor<string, []>("op_371_cast_fp16")];
            tensor<int32, [5]> var_372 = const()[name = tensor<string, []>("op_372"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_374_begin_0 = const()[name = tensor<string, []>("op_374_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_374_end_0 = const()[name = tensor<string, []>("op_374_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1370, 64])];
            tensor<bool, [5]> var_374_end_mask_0 = const()[name = tensor<string, []>("op_374_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_374_squeeze_mask_0 = const()[name = tensor<string, []>("op_374_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1370, 64]> qkv_7_cast_fp16 = transpose(perm = var_372, x = var_371_cast_fp16)[name = tensor<string, []>("transpose_21")];
            tensor<fp16, [1, 6, 1370, 64]> var_374_cast_fp16 = slice_by_index(begin = var_374_begin_0, end = var_374_end_0, end_mask = var_374_end_mask_0, squeeze_mask = var_374_squeeze_mask_0, x = qkv_7_cast_fp16)[name = tensor<string, []>("op_374_cast_fp16")];
            tensor<fp16, []> var_375_to_fp16 = const()[name = tensor<string, []>("op_375_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1370, 64]> q_7_cast_fp16 = mul(x = var_374_cast_fp16, y = var_375_to_fp16)[name = tensor<string, []>("q_7_cast_fp16")];
            tensor<int32, [5]> k_7_begin_0 = const()[name = tensor<string, []>("k_7_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_7_end_0 = const()[name = tensor<string, []>("k_7_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1370, 64])];
            tensor<bool, [5]> k_7_end_mask_0 = const()[name = tensor<string, []>("k_7_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_7_squeeze_mask_0 = const()[name = tensor<string, []>("k_7_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> k_7_cast_fp16 = slice_by_index(begin = k_7_begin_0, end = k_7_end_0, end_mask = k_7_end_mask_0, squeeze_mask = k_7_squeeze_mask_0, x = qkv_7_cast_fp16)[name = tensor<string, []>("k_7_cast_fp16")];
            tensor<int32, [5]> v_7_begin_0 = const()[name = tensor<string, []>("v_7_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_7_end_0 = const()[name = tensor<string, []>("v_7_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1370, 64])];
            tensor<bool, [5]> v_7_end_mask_0 = const()[name = tensor<string, []>("v_7_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_7_squeeze_mask_0 = const()[name = tensor<string, []>("v_7_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> v_7_cast_fp16 = slice_by_index(begin = v_7_begin_0, end = v_7_end_0, end_mask = v_7_end_mask_0, squeeze_mask = v_7_squeeze_mask_0, x = qkv_7_cast_fp16)[name = tensor<string, []>("v_7_cast_fp16")];
            tensor<bool, []> attn_13_transpose_x_1 = const()[name = tensor<string, []>("attn_13_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_13_transpose_y_1 = const()[name = tensor<string, []>("attn_13_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1370, 1370]> attn_13_cast_fp16 = matmul(transpose_x = attn_13_transpose_x_1, transpose_y = attn_13_transpose_y_1, x = q_7_cast_fp16, y = k_7_cast_fp16)[name = tensor<string, []>("attn_13_cast_fp16")];
            tensor<fp16, [1, 6, 1370, 1370]> input_63_cast_fp16 = softmax(axis = var_342, x = attn_13_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<bool, []> var_383_transpose_x_0 = const()[name = tensor<string, []>("op_383_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_383_transpose_y_0 = const()[name = tensor<string, []>("op_383_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1370, 64]> var_383_cast_fp16 = matmul(transpose_x = var_383_transpose_x_0, transpose_y = var_383_transpose_y_0, x = input_63_cast_fp16, y = v_7_cast_fp16)[name = tensor<string, []>("op_383_cast_fp16")];
            tensor<int32, [4]> var_384_perm_0 = const()[name = tensor<string, []>("op_384_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_385 = const()[name = tensor<string, []>("op_385"), val = tensor<int32, [3]>([1, 1370, 384])];
            tensor<fp16, [1, 1370, 6, 64]> var_384_cast_fp16 = transpose(perm = var_384_perm_0, x = var_383_cast_fp16)[name = tensor<string, []>("transpose_20")];
            tensor<fp16, [1, 1370, 384]> input_65_cast_fp16 = reshape(shape = var_385, x = var_384_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<fp16, [384, 384]> pretrained_blocks_3_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_3_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13048512)))];
            tensor<fp16, [384]> pretrained_blocks_3_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("pretrained_blocks_3_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13343488)))];
