program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.7.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 518, 518]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 518, 518]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 3, 1, 1]> mean_to_fp16 = const()[name = tensor<string, []>("mean_to_fp16"), val = tensor<fp16, [1, 3, 1, 1]>([[[[0x1.f0cp-2]], [[0x1.d3p-2]], [[0x1.9fcp-2]]]])];
            tensor<fp16, [1, 3, 518, 518]> image_to_fp16 = cast(dtype = image_to_fp16_dtype_0, x = image__scaled__)[name = tensor<string, []>("cast_32")];
            tensor<fp16, [1, 3, 518, 518]> var_6_cast_fp16 = sub(x = image_to_fp16, y = mean_to_fp16)[name = tensor<string, []>("op_6_cast_fp16")];
            tensor<fp16, [1, 3, 1, 1]> _inversed_x_3_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_x_3_y_0_to_fp16"), val = tensor<fp16, [1, 3, 1, 1]>([[[[0x1.178p+2]], [[0x1.1dcp+2]], [[0x1.1c8p+2]]]])];
            tensor<fp16, [1, 3, 518, 518]> _inversed_x_3_cast_fp16 = mul(x = var_6_cast_fp16, y = _inversed_x_3_y_0_to_fp16)[name = tensor<string, []>("_inversed_x_3_cast_fp16")];
            tensor<int32, []> var_22 = const()[name = tensor<string, []>("op_22"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_25 = const()[name = tensor<string, []>("op_25"), val = tensor<int32, []>(-1)];
            tensor<string, []> x_5_pad_type_0 = const()[name = tensor<string, []>("x_5_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> x_5_strides_0 = const()[name = tensor<string, []>("x_5_strides_0"), val = tensor<int32, [2]>([14, 14])];
            tensor<int32, [4]> x_5_pad_0 = const()[name = tensor<string, []>("x_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> x_5_dilations_0 = const()[name = tensor<string, []>("x_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> x_5_groups_0 = const()[name = tensor<string, []>("x_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [384, 3, 14, 14]> model_pretrained_patch_embed_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_patch_embed_proj_weight_to_fp16"), val = tensor<fp16, [384, 3, 14, 14]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [384]> model_pretrained_patch_embed_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_patch_embed_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(451712)))];
            tensor<fp16, [1, 384, 37, 37]> x_5_cast_fp16 = conv(bias = model_pretrained_patch_embed_proj_bias_to_fp16, dilations = x_5_dilations_0, groups = x_5_groups_0, pad = x_5_pad_0, pad_type = x_5_pad_type_0, strides = x_5_strides_0, weight = model_pretrained_patch_embed_proj_weight_to_fp16, x = _inversed_x_3_cast_fp16)[name = tensor<string, []>("x_5_cast_fp16")];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 384, 1369])];
            tensor<fp16, [1, 384, 1369]> var_96_cast_fp16 = reshape(shape = concat_0, x = x_5_cast_fp16)[name = tensor<string, []>("op_96_cast_fp16")];
            tensor<int32, [3]> x_7_perm_0 = const()[name = tensor<string, []>("x_7_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> x_9_interleave_0 = const()[name = tensor<string, []>("x_9_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 384]> model_pretrained_cls_token_to_fp16 = const()[name = tensor<string, []>("model_pretrained_cls_token_to_fp16"), val = tensor<fp16, [1, 1, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(452544)))];
            tensor<fp16, [1, 1369, 384]> x_7_cast_fp16 = transpose(perm = x_7_perm_0, x = var_96_cast_fp16)[name = tensor<string, []>("transpose_28")];
            tensor<fp16, [1, 1370, 384]> x_9_cast_fp16 = concat(axis = var_22, interleave = x_9_interleave_0, values = (model_pretrained_cls_token_to_fp16, x_7_cast_fp16))[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> model_pretrained_pos_embed_to_fp16 = const()[name = tensor<string, []>("model_pretrained_pos_embed_to_fp16"), val = tensor<fp16, [1, 1370, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(453376)))];
            tensor<fp16, [1, 1370, 384]> input_1_cast_fp16 = add(x = x_9_cast_fp16, y = model_pretrained_pos_embed_to_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [1]> x_11_axes_0 = const()[name = tensor<string, []>("x_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_0_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1505600)))];
            tensor<fp16, [384]> model_pretrained_blocks_0_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1506432)))];
            tensor<fp16, []> var_11_to_fp16 = const()[name = tensor<string, []>("op_11_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 1370, 384]> x_11_cast_fp16 = layer_norm(axes = x_11_axes_0, beta = model_pretrained_blocks_0_norm1_bias_to_fp16, epsilon = var_11_to_fp16, gamma = model_pretrained_blocks_0_norm1_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<fp16, [1152, 384]> model_pretrained_blocks_0_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1507264)))];
            tensor<fp16, [1152]> model_pretrained_blocks_0_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2392064)))];
            tensor<fp16, [1, 1370, 1152]> linear_0_cast_fp16 = linear(bias = model_pretrained_blocks_0_attn_qkv_bias_to_fp16, weight = model_pretrained_blocks_0_attn_qkv_weight_to_fp16, x = x_11_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<int32, [5]> var_125 = const()[name = tensor<string, []>("op_125"), val = tensor<int32, [5]>([1, 1370, 3, 6, 64])];
            tensor<fp16, [1, 1370, 3, 6, 64]> var_126_cast_fp16 = reshape(shape = var_125, x = linear_0_cast_fp16)[name = tensor<string, []>("op_126_cast_fp16")];
            tensor<int32, [5]> var_127 = const()[name = tensor<string, []>("op_127"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_129_begin_0 = const()[name = tensor<string, []>("op_129_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_129_end_0 = const()[name = tensor<string, []>("op_129_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1370, 64])];
            tensor<bool, [5]> var_129_end_mask_0 = const()[name = tensor<string, []>("op_129_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_129_squeeze_mask_0 = const()[name = tensor<string, []>("op_129_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1370, 64]> qkv_1_cast_fp16 = transpose(perm = var_127, x = var_126_cast_fp16)[name = tensor<string, []>("transpose_27")];
            tensor<fp16, [1, 6, 1370, 64]> var_129_cast_fp16 = slice_by_index(begin = var_129_begin_0, end = var_129_end_0, end_mask = var_129_end_mask_0, squeeze_mask = var_129_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("op_129_cast_fp16")];
            tensor<fp16, []> var_130_to_fp16 = const()[name = tensor<string, []>("op_130_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1370, 64]> q_1_cast_fp16 = mul(x = var_129_cast_fp16, y = var_130_to_fp16)[name = tensor<string, []>("q_1_cast_fp16")];
            tensor<int32, [5]> k_1_begin_0 = const()[name = tensor<string, []>("k_1_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_1_end_0 = const()[name = tensor<string, []>("k_1_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1370, 64])];
            tensor<bool, [5]> k_1_end_mask_0 = const()[name = tensor<string, []>("k_1_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_1_squeeze_mask_0 = const()[name = tensor<string, []>("k_1_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> k_1_cast_fp16 = slice_by_index(begin = k_1_begin_0, end = k_1_end_0, end_mask = k_1_end_mask_0, squeeze_mask = k_1_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<int32, [5]> v_1_begin_0 = const()[name = tensor<string, []>("v_1_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_1_end_0 = const()[name = tensor<string, []>("v_1_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1370, 64])];
            tensor<bool, [5]> v_1_end_mask_0 = const()[name = tensor<string, []>("v_1_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_1_squeeze_mask_0 = const()[name = tensor<string, []>("v_1_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> v_1_cast_fp16 = slice_by_index(begin = v_1_begin_0, end = v_1_end_0, end_mask = v_1_end_mask_0, squeeze_mask = v_1_squeeze_mask_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("v_1_cast_fp16")];
            tensor<bool, []> attn_1_transpose_x_1 = const()[name = tensor<string, []>("attn_1_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_1_transpose_y_1 = const()[name = tensor<string, []>("attn_1_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1370, 1370]> attn_1_cast_fp16 = matmul(transpose_x = attn_1_transpose_x_1, transpose_y = attn_1_transpose_y_1, x = q_1_cast_fp16, y = k_1_cast_fp16)[name = tensor<string, []>("attn_1_cast_fp16")];
            tensor<fp16, [1, 6, 1370, 1370]> input_3_cast_fp16 = softmax(axis = var_25, x = attn_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<bool, []> var_138_transpose_x_0 = const()[name = tensor<string, []>("op_138_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_138_transpose_y_0 = const()[name = tensor<string, []>("op_138_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1370, 64]> var_138_cast_fp16 = matmul(transpose_x = var_138_transpose_x_0, transpose_y = var_138_transpose_y_0, x = input_3_cast_fp16, y = v_1_cast_fp16)[name = tensor<string, []>("op_138_cast_fp16")];
            tensor<int32, [4]> var_139_perm_0 = const()[name = tensor<string, []>("op_139_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_140 = const()[name = tensor<string, []>("op_140"), val = tensor<int32, [3]>([1, 1370, 384])];
            tensor<fp16, [1, 1370, 6, 64]> var_139_cast_fp16 = transpose(perm = var_139_perm_0, x = var_138_cast_fp16)[name = tensor<string, []>("transpose_26")];
            tensor<fp16, [1, 1370, 384]> input_5_cast_fp16 = reshape(shape = var_140, x = var_139_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [384, 384]> model_pretrained_blocks_0_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2394432)))];
            tensor<fp16, [384]> model_pretrained_blocks_0_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2689408)))];
            tensor<fp16, [1, 1370, 384]> linear_1_cast_fp16 = linear(bias = model_pretrained_blocks_0_attn_proj_bias_to_fp16, weight = model_pretrained_blocks_0_attn_proj_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_0_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2690240)))];
            tensor<fp16, [1, 1370, 384]> var_147_cast_fp16 = mul(x = linear_1_cast_fp16, y = model_pretrained_blocks_0_ls1_gamma_to_fp16)[name = tensor<string, []>("op_147_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_9_cast_fp16 = add(x = input_1_cast_fp16, y = var_147_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [1]> input_11_axes_0 = const()[name = tensor<string, []>("input_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_0_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2691072)))];
            tensor<fp16, [384]> model_pretrained_blocks_0_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2691904)))];
            tensor<fp16, [1, 1370, 384]> input_11_cast_fp16 = layer_norm(axes = input_11_axes_0, beta = model_pretrained_blocks_0_norm2_bias_to_fp16, epsilon = var_11_to_fp16, gamma = model_pretrained_blocks_0_norm2_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [1536, 384]> model_pretrained_blocks_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2692736)))];
            tensor<fp16, [1536]> model_pretrained_blocks_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3872448)))];
            tensor<fp16, [1, 1370, 1536]> linear_2_cast_fp16 = linear(bias = model_pretrained_blocks_0_mlp_fc1_bias_to_fp16, weight = model_pretrained_blocks_0_mlp_fc1_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<string, []> input_15_mode_0 = const()[name = tensor<string, []>("input_15_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1370, 1536]> input_15_cast_fp16 = gelu(mode = input_15_mode_0, x = linear_2_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [384, 1536]> model_pretrained_blocks_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3875584)))];
            tensor<fp16, [384]> model_pretrained_blocks_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5055296)))];
            tensor<fp16, [1, 1370, 384]> linear_3_cast_fp16 = linear(bias = model_pretrained_blocks_0_mlp_fc2_bias_to_fp16, weight = model_pretrained_blocks_0_mlp_fc2_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_0_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_0_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5056128)))];
            tensor<fp16, [1, 1370, 384]> var_165_cast_fp16 = mul(x = linear_3_cast_fp16, y = model_pretrained_blocks_0_ls2_gamma_to_fp16)[name = tensor<string, []>("op_165_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_21_cast_fp16 = add(x = input_9_cast_fp16, y = var_165_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<int32, [1]> x_17_axes_0 = const()[name = tensor<string, []>("x_17_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_1_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5056960)))];
            tensor<fp16, [384]> model_pretrained_blocks_1_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5057792)))];
            tensor<fp16, [1, 1370, 384]> x_17_cast_fp16 = layer_norm(axes = x_17_axes_0, beta = model_pretrained_blocks_1_norm1_bias_to_fp16, epsilon = var_11_to_fp16, gamma = model_pretrained_blocks_1_norm1_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("x_17_cast_fp16")];
            tensor<fp16, [1152, 384]> model_pretrained_blocks_1_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5058624)))];
            tensor<fp16, [1152]> model_pretrained_blocks_1_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5943424)))];
            tensor<fp16, [1, 1370, 1152]> linear_4_cast_fp16 = linear(bias = model_pretrained_blocks_1_attn_qkv_bias_to_fp16, weight = model_pretrained_blocks_1_attn_qkv_weight_to_fp16, x = x_17_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<int32, [5]> var_188 = const()[name = tensor<string, []>("op_188"), val = tensor<int32, [5]>([1, 1370, 3, 6, 64])];
            tensor<fp16, [1, 1370, 3, 6, 64]> var_189_cast_fp16 = reshape(shape = var_188, x = linear_4_cast_fp16)[name = tensor<string, []>("op_189_cast_fp16")];
            tensor<int32, [5]> var_190 = const()[name = tensor<string, []>("op_190"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_192_begin_0 = const()[name = tensor<string, []>("op_192_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_192_end_0 = const()[name = tensor<string, []>("op_192_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1370, 64])];
            tensor<bool, [5]> var_192_end_mask_0 = const()[name = tensor<string, []>("op_192_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_192_squeeze_mask_0 = const()[name = tensor<string, []>("op_192_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1370, 64]> qkv_3_cast_fp16 = transpose(perm = var_190, x = var_189_cast_fp16)[name = tensor<string, []>("transpose_25")];
            tensor<fp16, [1, 6, 1370, 64]> var_192_cast_fp16 = slice_by_index(begin = var_192_begin_0, end = var_192_end_0, end_mask = var_192_end_mask_0, squeeze_mask = var_192_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("op_192_cast_fp16")];
            tensor<fp16, []> var_193_to_fp16 = const()[name = tensor<string, []>("op_193_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1370, 64]> q_3_cast_fp16 = mul(x = var_192_cast_fp16, y = var_193_to_fp16)[name = tensor<string, []>("q_3_cast_fp16")];
            tensor<int32, [5]> k_3_begin_0 = const()[name = tensor<string, []>("k_3_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_3_end_0 = const()[name = tensor<string, []>("k_3_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1370, 64])];
            tensor<bool, [5]> k_3_end_mask_0 = const()[name = tensor<string, []>("k_3_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_3_squeeze_mask_0 = const()[name = tensor<string, []>("k_3_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> k_3_cast_fp16 = slice_by_index(begin = k_3_begin_0, end = k_3_end_0, end_mask = k_3_end_mask_0, squeeze_mask = k_3_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<int32, [5]> v_3_begin_0 = const()[name = tensor<string, []>("v_3_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_3_end_0 = const()[name = tensor<string, []>("v_3_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1370, 64])];
            tensor<bool, [5]> v_3_end_mask_0 = const()[name = tensor<string, []>("v_3_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_3_squeeze_mask_0 = const()[name = tensor<string, []>("v_3_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> v_3_cast_fp16 = slice_by_index(begin = v_3_begin_0, end = v_3_end_0, end_mask = v_3_end_mask_0, squeeze_mask = v_3_squeeze_mask_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("v_3_cast_fp16")];
            tensor<bool, []> attn_5_transpose_x_1 = const()[name = tensor<string, []>("attn_5_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_5_transpose_y_1 = const()[name = tensor<string, []>("attn_5_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1370, 1370]> attn_5_cast_fp16 = matmul(transpose_x = attn_5_transpose_x_1, transpose_y = attn_5_transpose_y_1, x = q_3_cast_fp16, y = k_3_cast_fp16)[name = tensor<string, []>("attn_5_cast_fp16")];
            tensor<fp16, [1, 6, 1370, 1370]> input_23_cast_fp16 = softmax(axis = var_25, x = attn_5_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<bool, []> var_201_transpose_x_0 = const()[name = tensor<string, []>("op_201_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_201_transpose_y_0 = const()[name = tensor<string, []>("op_201_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1370, 64]> var_201_cast_fp16 = matmul(transpose_x = var_201_transpose_x_0, transpose_y = var_201_transpose_y_0, x = input_23_cast_fp16, y = v_3_cast_fp16)[name = tensor<string, []>("op_201_cast_fp16")];
            tensor<int32, [4]> var_202_perm_0 = const()[name = tensor<string, []>("op_202_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_203 = const()[name = tensor<string, []>("op_203"), val = tensor<int32, [3]>([1, 1370, 384])];
            tensor<fp16, [1, 1370, 6, 64]> var_202_cast_fp16 = transpose(perm = var_202_perm_0, x = var_201_cast_fp16)[name = tensor<string, []>("transpose_24")];
            tensor<fp16, [1, 1370, 384]> input_25_cast_fp16 = reshape(shape = var_203, x = var_202_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [384, 384]> model_pretrained_blocks_1_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5945792)))];
            tensor<fp16, [384]> model_pretrained_blocks_1_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6240768)))];
            tensor<fp16, [1, 1370, 384]> linear_5_cast_fp16 = linear(bias = model_pretrained_blocks_1_attn_proj_bias_to_fp16, weight = model_pretrained_blocks_1_attn_proj_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_1_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6241600)))];
            tensor<fp16, [1, 1370, 384]> var_210_cast_fp16 = mul(x = linear_5_cast_fp16, y = model_pretrained_blocks_1_ls1_gamma_to_fp16)[name = tensor<string, []>("op_210_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_29_cast_fp16 = add(x = input_21_cast_fp16, y = var_210_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<int32, [1]> input_31_axes_0 = const()[name = tensor<string, []>("input_31_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_1_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6242432)))];
            tensor<fp16, [384]> model_pretrained_blocks_1_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6243264)))];
            tensor<fp16, [1, 1370, 384]> input_31_cast_fp16 = layer_norm(axes = input_31_axes_0, beta = model_pretrained_blocks_1_norm2_bias_to_fp16, epsilon = var_11_to_fp16, gamma = model_pretrained_blocks_1_norm2_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [1536, 384]> model_pretrained_blocks_1_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6244096)))];
            tensor<fp16, [1536]> model_pretrained_blocks_1_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7423808)))];
            tensor<fp16, [1, 1370, 1536]> linear_6_cast_fp16 = linear(bias = model_pretrained_blocks_1_mlp_fc1_bias_to_fp16, weight = model_pretrained_blocks_1_mlp_fc1_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<string, []> input_35_mode_0 = const()[name = tensor<string, []>("input_35_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1370, 1536]> input_35_cast_fp16 = gelu(mode = input_35_mode_0, x = linear_6_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<fp16, [384, 1536]> model_pretrained_blocks_1_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7426944)))];
            tensor<fp16, [384]> model_pretrained_blocks_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8606656)))];
            tensor<fp16, [1, 1370, 384]> linear_7_cast_fp16 = linear(bias = model_pretrained_blocks_1_mlp_fc2_bias_to_fp16, weight = model_pretrained_blocks_1_mlp_fc2_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_1_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_1_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8607488)))];
            tensor<fp16, [1, 1370, 384]> var_228_cast_fp16 = mul(x = linear_7_cast_fp16, y = model_pretrained_blocks_1_ls2_gamma_to_fp16)[name = tensor<string, []>("op_228_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_41_cast_fp16 = add(x = input_29_cast_fp16, y = var_228_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<int32, [1]> x_23_axes_0 = const()[name = tensor<string, []>("x_23_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_2_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8608320)))];
            tensor<fp16, [384]> model_pretrained_blocks_2_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8609152)))];
            tensor<fp16, [1, 1370, 384]> x_23_cast_fp16 = layer_norm(axes = x_23_axes_0, beta = model_pretrained_blocks_2_norm1_bias_to_fp16, epsilon = var_11_to_fp16, gamma = model_pretrained_blocks_2_norm1_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<fp16, [1152, 384]> model_pretrained_blocks_2_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8609984)))];
            tensor<fp16, [1152]> model_pretrained_blocks_2_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9494784)))];
            tensor<fp16, [1, 1370, 1152]> linear_8_cast_fp16 = linear(bias = model_pretrained_blocks_2_attn_qkv_bias_to_fp16, weight = model_pretrained_blocks_2_attn_qkv_weight_to_fp16, x = x_23_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [5]> var_251 = const()[name = tensor<string, []>("op_251"), val = tensor<int32, [5]>([1, 1370, 3, 6, 64])];
            tensor<fp16, [1, 1370, 3, 6, 64]> var_252_cast_fp16 = reshape(shape = var_251, x = linear_8_cast_fp16)[name = tensor<string, []>("op_252_cast_fp16")];
            tensor<int32, [5]> var_253 = const()[name = tensor<string, []>("op_253"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_255_begin_0 = const()[name = tensor<string, []>("op_255_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_255_end_0 = const()[name = tensor<string, []>("op_255_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1370, 64])];
            tensor<bool, [5]> var_255_end_mask_0 = const()[name = tensor<string, []>("op_255_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_255_squeeze_mask_0 = const()[name = tensor<string, []>("op_255_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1370, 64]> qkv_5_cast_fp16 = transpose(perm = var_253, x = var_252_cast_fp16)[name = tensor<string, []>("transpose_23")];
            tensor<fp16, [1, 6, 1370, 64]> var_255_cast_fp16 = slice_by_index(begin = var_255_begin_0, end = var_255_end_0, end_mask = var_255_end_mask_0, squeeze_mask = var_255_squeeze_mask_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("op_255_cast_fp16")];
            tensor<fp16, []> var_256_to_fp16 = const()[name = tensor<string, []>("op_256_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1370, 64]> q_5_cast_fp16 = mul(x = var_255_cast_fp16, y = var_256_to_fp16)[name = tensor<string, []>("q_5_cast_fp16")];
            tensor<int32, [5]> k_5_begin_0 = const()[name = tensor<string, []>("k_5_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_5_end_0 = const()[name = tensor<string, []>("k_5_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1370, 64])];
            tensor<bool, [5]> k_5_end_mask_0 = const()[name = tensor<string, []>("k_5_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_5_squeeze_mask_0 = const()[name = tensor<string, []>("k_5_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> k_5_cast_fp16 = slice_by_index(begin = k_5_begin_0, end = k_5_end_0, end_mask = k_5_end_mask_0, squeeze_mask = k_5_squeeze_mask_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("k_5_cast_fp16")];
            tensor<int32, [5]> v_5_begin_0 = const()[name = tensor<string, []>("v_5_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_5_end_0 = const()[name = tensor<string, []>("v_5_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1370, 64])];
            tensor<bool, [5]> v_5_end_mask_0 = const()[name = tensor<string, []>("v_5_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_5_squeeze_mask_0 = const()[name = tensor<string, []>("v_5_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> v_5_cast_fp16 = slice_by_index(begin = v_5_begin_0, end = v_5_end_0, end_mask = v_5_end_mask_0, squeeze_mask = v_5_squeeze_mask_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("v_5_cast_fp16")];
            tensor<bool, []> attn_9_transpose_x_1 = const()[name = tensor<string, []>("attn_9_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_9_transpose_y_1 = const()[name = tensor<string, []>("attn_9_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1370, 1370]> attn_9_cast_fp16 = matmul(transpose_x = attn_9_transpose_x_1, transpose_y = attn_9_transpose_y_1, x = q_5_cast_fp16, y = k_5_cast_fp16)[name = tensor<string, []>("attn_9_cast_fp16")];
            tensor<fp16, [1, 6, 1370, 1370]> input_43_cast_fp16 = softmax(axis = var_25, x = attn_9_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<bool, []> var_264_transpose_x_0 = const()[name = tensor<string, []>("op_264_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_264_transpose_y_0 = const()[name = tensor<string, []>("op_264_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1370, 64]> var_264_cast_fp16 = matmul(transpose_x = var_264_transpose_x_0, transpose_y = var_264_transpose_y_0, x = input_43_cast_fp16, y = v_5_cast_fp16)[name = tensor<string, []>("op_264_cast_fp16")];
            tensor<int32, [4]> var_265_perm_0 = const()[name = tensor<string, []>("op_265_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_266 = const()[name = tensor<string, []>("op_266"), val = tensor<int32, [3]>([1, 1370, 384])];
            tensor<fp16, [1, 1370, 6, 64]> var_265_cast_fp16 = transpose(perm = var_265_perm_0, x = var_264_cast_fp16)[name = tensor<string, []>("transpose_22")];
            tensor<fp16, [1, 1370, 384]> input_45_cast_fp16 = reshape(shape = var_266, x = var_265_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<fp16, [384, 384]> model_pretrained_blocks_2_attn_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_attn_proj_weight_to_fp16"), val = tensor<fp16, [384, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9497152)))];
            tensor<fp16, [384]> model_pretrained_blocks_2_attn_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_attn_proj_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9792128)))];
            tensor<fp16, [1, 1370, 384]> linear_9_cast_fp16 = linear(bias = model_pretrained_blocks_2_attn_proj_bias_to_fp16, weight = model_pretrained_blocks_2_attn_proj_weight_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_2_ls1_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_ls1_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9792960)))];
            tensor<fp16, [1, 1370, 384]> var_273_cast_fp16 = mul(x = linear_9_cast_fp16, y = model_pretrained_blocks_2_ls1_gamma_to_fp16)[name = tensor<string, []>("op_273_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_49_cast_fp16 = add(x = input_41_cast_fp16, y = var_273_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<int32, [1]> input_51_axes_0 = const()[name = tensor<string, []>("input_51_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_2_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_norm2_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9793792)))];
            tensor<fp16, [384]> model_pretrained_blocks_2_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_norm2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9794624)))];
            tensor<fp16, [1, 1370, 384]> input_51_cast_fp16 = layer_norm(axes = input_51_axes_0, beta = model_pretrained_blocks_2_norm2_bias_to_fp16, epsilon = var_11_to_fp16, gamma = model_pretrained_blocks_2_norm2_weight_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<fp16, [1536, 384]> model_pretrained_blocks_2_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1536, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9795456)))];
            tensor<fp16, [1536]> model_pretrained_blocks_2_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10975168)))];
            tensor<fp16, [1, 1370, 1536]> linear_10_cast_fp16 = linear(bias = model_pretrained_blocks_2_mlp_fc1_bias_to_fp16, weight = model_pretrained_blocks_2_mlp_fc1_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<string, []> input_55_mode_0 = const()[name = tensor<string, []>("input_55_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 1370, 1536]> input_55_cast_fp16 = gelu(mode = input_55_mode_0, x = linear_10_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<fp16, [384, 1536]> model_pretrained_blocks_2_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [384, 1536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10978304)))];
            tensor<fp16, [384]> model_pretrained_blocks_2_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12158016)))];
            tensor<fp16, [1, 1370, 384]> linear_11_cast_fp16 = linear(bias = model_pretrained_blocks_2_mlp_fc2_bias_to_fp16, weight = model_pretrained_blocks_2_mlp_fc2_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [384]> model_pretrained_blocks_2_ls2_gamma_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_2_ls2_gamma_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12158848)))];
            tensor<fp16, [1, 1370, 384]> var_291_cast_fp16 = mul(x = linear_11_cast_fp16, y = model_pretrained_blocks_2_ls2_gamma_to_fp16)[name = tensor<string, []>("op_291_cast_fp16")];
            tensor<fp16, [1, 1370, 384]> input_61_cast_fp16 = add(x = input_49_cast_fp16, y = var_291_cast_fp16)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<int32, [1]> x_29_axes_0 = const()[name = tensor<string, []>("x_29_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [384]> model_pretrained_blocks_3_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_3_norm1_weight_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12159680)))];
            tensor<fp16, [384]> model_pretrained_blocks_3_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_3_norm1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12160512)))];
            tensor<fp16, [1, 1370, 384]> x_29_cast_fp16 = layer_norm(axes = x_29_axes_0, beta = model_pretrained_blocks_3_norm1_bias_to_fp16, epsilon = var_11_to_fp16, gamma = model_pretrained_blocks_3_norm1_weight_to_fp16, x = input_61_cast_fp16)[name = tensor<string, []>("x_29_cast_fp16")];
            tensor<fp16, [1152, 384]> model_pretrained_blocks_3_attn_qkv_weight_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_3_attn_qkv_weight_to_fp16"), val = tensor<fp16, [1152, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12161344)))];
            tensor<fp16, [1152]> model_pretrained_blocks_3_attn_qkv_bias_to_fp16 = const()[name = tensor<string, []>("model_pretrained_blocks_3_attn_qkv_bias_to_fp16"), val = tensor<fp16, [1152]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13046144)))];
            tensor<fp16, [1, 1370, 1152]> linear_12_cast_fp16 = linear(bias = model_pretrained_blocks_3_attn_qkv_bias_to_fp16, weight = model_pretrained_blocks_3_attn_qkv_weight_to_fp16, x = x_29_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [5]> var_314 = const()[name = tensor<string, []>("op_314"), val = tensor<int32, [5]>([1, 1370, 3, 6, 64])];
            tensor<fp16, [1, 1370, 3, 6, 64]> var_315_cast_fp16 = reshape(shape = var_314, x = linear_12_cast_fp16)[name = tensor<string, []>("op_315_cast_fp16")];
            tensor<int32, [5]> var_316 = const()[name = tensor<string, []>("op_316"), val = tensor<int32, [5]>([2, 0, 3, 1, 4])];
            tensor<int32, [5]> var_318_begin_0 = const()[name = tensor<string, []>("op_318_begin_0"), val = tensor<int32, [5]>([0, 0, 0, 0, 0])];
            tensor<int32, [5]> var_318_end_0 = const()[name = tensor<string, []>("op_318_end_0"), val = tensor<int32, [5]>([1, 1, 6, 1370, 64])];
            tensor<bool, [5]> var_318_end_mask_0 = const()[name = tensor<string, []>("op_318_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> var_318_squeeze_mask_0 = const()[name = tensor<string, []>("op_318_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [3, 1, 6, 1370, 64]> qkv_7_cast_fp16 = transpose(perm = var_316, x = var_315_cast_fp16)[name = tensor<string, []>("transpose_21")];
            tensor<fp16, [1, 6, 1370, 64]> var_318_cast_fp16 = slice_by_index(begin = var_318_begin_0, end = var_318_end_0, end_mask = var_318_end_mask_0, squeeze_mask = var_318_squeeze_mask_0, x = qkv_7_cast_fp16)[name = tensor<string, []>("op_318_cast_fp16")];
            tensor<fp16, []> var_319_to_fp16 = const()[name = tensor<string, []>("op_319_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 6, 1370, 64]> q_7_cast_fp16 = mul(x = var_318_cast_fp16, y = var_319_to_fp16)[name = tensor<string, []>("q_7_cast_fp16")];
            tensor<int32, [5]> k_7_begin_0 = const()[name = tensor<string, []>("k_7_begin_0"), val = tensor<int32, [5]>([1, 0, 0, 0, 0])];
            tensor<int32, [5]> k_7_end_0 = const()[name = tensor<string, []>("k_7_end_0"), val = tensor<int32, [5]>([2, 1, 6, 1370, 64])];
            tensor<bool, [5]> k_7_end_mask_0 = const()[name = tensor<string, []>("k_7_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> k_7_squeeze_mask_0 = const()[name = tensor<string, []>("k_7_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> k_7_cast_fp16 = slice_by_index(begin = k_7_begin_0, end = k_7_end_0, end_mask = k_7_end_mask_0, squeeze_mask = k_7_squeeze_mask_0, x = qkv_7_cast_fp16)[name = tensor<string, []>("k_7_cast_fp16")];
            tensor<int32, [5]> v_7_begin_0 = const()[name = tensor<string, []>("v_7_begin_0"), val = tensor<int32, [5]>([2, 0, 0, 0, 0])];
            tensor<int32, [5]> v_7_end_0 = const()[name = tensor<string, []>("v_7_end_0"), val = tensor<int32, [5]>([3, 1, 6, 1370, 64])];
            tensor<bool, [5]> v_7_end_mask_0 = const()[name = tensor<string, []>("v_7_end_mask_0"), val = tensor<bool, [5]>([false, true, true, true, true])];
            tensor<bool, [5]> v_7_squeeze_mask_0 = const()[name = tensor<string, []>("v_7_squeeze_mask_0"), val = tensor<bool, [5]>([true, false, false, false, false])];
            tensor<fp16, [1, 6, 1370, 64]> v_7_cast_fp16 = slice_by_index(begin = v_7_begin_0, end = v_7_end_0, end_mask = v_7_end_mask_0, squeeze_mask = v_7_squeeze_mask_0, x = qkv_7_cast_fp16)[name = tensor<string, []>("v_7_cast_fp16")];
            tensor<bool, []> attn_13_transpose_x_1 = const()[name = tensor<string, []>("attn_13_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_13_transpose_y_1 = const()[name = tensor<string, []>("attn_13_transpose_y_1"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 6, 1370, 1370]> attn_13_cast_fp16 = matmul(transpose_x = attn_13_transpose_x_1, transpose_y = attn_13_transpose_y_1, x = q_7_cast_fp16, y = k_7_cast_fp16)[name = tensor<string, []>("attn_13_cast_fp16")];
            tensor<fp16, [1, 6, 1370, 1370]> input_63_cast_fp16 = softmax(axis = var_25, x = attn_13_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<bool, []> var_327_transpose_x_0 = const()[name = tensor<string, []>("op_327_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_327_transpose_y_0 = const()[name = tensor<string, []>("op_327_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 1370, 64]> var_327_cast_fp16 = matmul(transpose_x = var_327_transpose_x_0, transpose_y = var_327_transpose_y_0, x = input_63_cast_fp16, y = v_7_cast_fp16)[name = tensor<string, []>("op_327_cast_fp16")];
            tensor<int32, [4]> var_328_perm_0 = const()[name = tensor<string, []>("op_328_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_329 = const()[name = tensor<string, []>("op_329"), val = tensor<int32, [3]>([1, 1370, 384])];
            tensor<fp16, [1, 1370, 6, 64]> var_328_cast_fp16 = transpose(perm = var_328_perm_0, x = var_327_cast_fp16)[name = tensor<string, []>("transpose_20")];
            tensor<fp16, [1, 1370, 384]> input_65_cast_fp16 = reshape(shape = var_329, x = var_328_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
